Revit 2027 API
SizingOptions.IsValid Method
 Checks if the options are valid and ready for sizing operation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 Returns true if the options are valid, false otherwise.
Remarks
 The options are valid if the parameters including density and viscosity are correctly initialized to be non-zero values,
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace